hangcui1201/DSP_TI_TMS320F28379D/F28379D_Projects/libraries/boot_rom/f2838x/rev0/rom_sources/cpu1/F2838x_ROM/driverlib/dcc.h
//###########################################################################
//
// FILE:   dcc.h
//
// TITLE:  C28x DCC driver.
//
//###########################################################################
// $TI Release:  $
// $Release Date:  $
// $Copyright:  $
//###########################################################################

#ifndef DCC_H
#define DCC_H

//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************
#ifdef __cplusplus
extern "C"
{
#endif

//*****************************************************************************
//
//! \addtogroup dcc_api DCC
//! @{
//
//*****************************************************************************

#include <stdbool.h>
#include <stdint.h>
#include "inc/hw_dcc.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "cpu.h"
#include "debug.h"

//
// The reset value required to start or enable specific DCC operations
//
#define DCC_ENABLE_VALUE     (0xAU)

//
// The reset value required to stop or disable specific DCC operations
//
#define DCC_DISABLE_VALUE    (0x5U)

//
// A 16-bit register mask
//
#define DCC_REG_WORD_MASK    (0xFFFFU)

//
// A 7-bit register mask
//
#define DCC_REG_BYTE_MASK    (0x7FU)

//
// A mask for the DCC counter seed registers
//
#define DCC_SEED_REG_MASK    (0xFFF0U)

//
// A mask for the DCC counter seed value
//
#define DCC_SEED_CNT_MASK    (0xF0000U)

//*****************************************************************************
//
//! The following are defines for the mode parameter of the
//! DCC_enableSingleShotMode() function.
//
//*****************************************************************************
typedef enum
{
    //! Use to stop counting when counter0 and valid0 both reach zero
    DCC_MODE_COUNTER_ZERO = 0xA00U,

    //! Use to stop counting when counter1 reaches zero
    DCC_MODE_COUNTER_ONE  = 0xB00U
} DCC_SingleShotMode;

//*****************************************************************************
//
//! The following are defines for the identifier parameter of the
//! DCC_getRevisionNumber() function.
//
//*****************************************************************************
typedef enum
{
    DCC_REVISION_MINOR       = 0x0U,  //!< The module minor revision number
    DCC_REVISION_CUSTOM      = 0x1U,  //!< The custom module revision number
    DCC_REVISION_MAJOR       = 0x2U,  //!< The module major revision number
    DCC_REVISION_DESIGN      = 0x3U,  //!< The module design release number
    DCC_REVISION_FUNCTIONAL  = 0x4U,  //!< The module functional release number
    DCC_REVISION_SCHEME      = 0x5U   //!< The scheme of the module
} DCC_RevisionNumber;

//*****************************************************************************
//
//! The following are defines for the source parameter of the
//! DCC_setCounter1ClkSource() function.
//
//*****************************************************************************
typedef enum
{
    DCC_COUNT1SRC_PLL           = 0x0U, //!< PLL021SSP Clock Out Source
    DCC_COUNT1SRC_AUXPLL        = 0x1U, //!< AUXPLL Clock Out Source
    DCC_COUNT1SRC_INTOSC1       = 0x2U, //!< Internal Oscillator1 Clock Source
    DCC_COUNT1SRC_INTOSC2       = 0x3U, //!< Internal Oscillator2 Clock Source
    DCC_COUNT1SRC_PUMOSC        = 0x4U, //!< PUMOSC Clock Source
    DCC_COUNT1SRC_CMCLK         = 0x5U, //!< CM Clock Source
    DCC_COUNT1SRC_CPU1SYSCLK    = 0x6U, //!< CPU1 System Clock Source
    DCC_COUNT1SRC_ENET_RXCLK    = 0x7U, //!< etherNET RXCLK Clock Source
    DCC_COUNT1SRC_CPU2SYSCLK    = 0x8U, //!< CPU2 System Clock Source
    DCC_COUNT1SRC_CROSSBAR      = 0x9U, //!< Input Crossbar Clock Source
    DCC_COUNT1SRC_AUXCLK        = 0xAU, //!< AUX Clock Source
    DCC_COUNT1SRC_ETPWM         = 0xBU, //!< ETPWM Clock Source
    DCC_COUNT1SRC_LSPCLK        = 0xCU, //!< LSP Clock Source
    DCC_COUNT1SRC_ECAT0_RXCLK   = 0xDU, //!< MII0 RXCLK(etherCAT) Clock Source
    DCC_COUNT1SRC_WDCLK         = 0xEU, //!< Watch Dog Clock Source
    DCC_COUNT1SRC_CANX          = 0xFU, //!< CANxBIT Clock Source
    DCC_COUNT1SRC_SYSAPLLCLK     = 0x10U, //!< System APLL Clock Source
    DCC_COUNT1SRC_SYSAPLLVCO     = 0x11U, //!< System APLL Voltage control
    DCC_COUNT1SRC_SYSAPLLVCO_BY2 = 0x12U, //!< System APLL Voltage control
    DCC_COUNT1SRC_SYSAPLLFMDIV   = 0x13U, //!< System APLL FM DIV
    DCC_COUNT1SRC_SYSAPLLFNDIV   = 0x14U, //!< System APLL FN DIV
    DCC_COUNT1SRC_SYSAPLLINTOSC  = 0x15U, //!< System APLL Internal Osc Clk
    DCC_COUNT1SRC_SYSAPLLCLK_AUX = 0x16U, //!< System APLL Aux Clk
    DCC_COUNT1SRC_ECAT1_RXCLK    = 0x17U, //!< MII1 RXCLK(etherCAT) Clk Src
    DCC_COUNT1SRC_AUXAPLLCLK     = 0x18U, //!< Aux APLL Clock Source
    DCC_COUNT1SRC_AUXAPLLVCO     = 0x19U, //!< Aux APLL Voltage control Src
    DCC_COUNT1SRC_AUXAPLLVCO_BY2 = 0x1AU, //!< Aux APLL Voltage control Src
    DCC_COUNT1SRC_AUXAPLLFMDIV   = 0x1BU, //!< Aux APLL FM DIV Source
    DCC_COUNT1SRC_AUXAPLLFNDIV   = 0x1CU, //!< Aux APLL FN DIV Source
    DCC_COUNT1SRC_AUXAPLLINTOSC  = 0x1DU, //!< Aux APLL Internal Osc Clk
    DCC_COUNT1SRC_AUXAPLLCLK_AUX = 0x1EU, //!< Aux APLL Aux Clk Source
} DCC_Count1ClockSource;

//*****************************************************************************
//
//! The following are defines for the source parameter of the
//! DCC_setCounter0ClkSource() function.
//
//*****************************************************************************
typedef enum
{
    DCC_COUNT0SRC_XTAL       = 0x0U,    //!< Accurate Clock Source
    DCC_COUNT0SRC_INTOSC1    = 0x1U,    //!< Internal Oscillator1 Clock Source
    DCC_COUNT0SRC_INTOSC2    = 0x2U,    //!< Internal Oscillator2 Clock Source
    DCC_COUNT0SRC_CPU1SYSCLK = 0x5U,    //!< CPU1 System Clock Source
    DCC_COUNT0SRC_CPU2SYSCLK = 0x6U,    //!< CPU2 System Clock Source
    DCC_COUNT0SRC_XBAR       = 0xCU     //!< Input XBAR Clock Source
} DCC_Count0ClockSource;

//*****************************************************************************
//
// Prototypes for the APIs.
//
//*****************************************************************************
//*****************************************************************************
//
//! \internal
//! Checks DCC base address.
//!
//! \param base specifies the DCC module base address.
//!
//! This function determines if an DCC module base address is valid.
//!
//! \return Returns \b true if the base address is valid and \b false
//! otherwise.
//
//*****************************************************************************
#ifdef DEBUG
static bool
DCC_isBaseValid(uint32_t base)
{
    return((base == DCC0_BASE) || (base == DCC1_BASE) ||
           (base == DCC2_BASE));

