hangcui1201/DSP_TI_TMS320F28379D/F28379D_Projects/libraries/boot_rom/f2838x/rev0/rom_sources/cpu1/F2838x_ROM/driverlib/dcc.h
    HWREGH(base + DCC_O_STATUS) |= DCC_STATUS_ERR;

    EDIS;
}

//*****************************************************************************
//
//! Clear Single-Shot Done Status Flag
//!
//! \param base is the DCC module base address
//!
//! This function clears the DCC single-shot done status flag.
//!
//! \return None.
//
//*****************************************************************************
static inline void
DCC_clearDoneFlag(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DCC_isBaseValid(base));

    //
    // Clear done status flag
    //
    EALLOW;

    HWREGH(base + DCC_O_STATUS) |= DCC_STATUS_DONE;

    EDIS;
}

//*****************************************************************************
//
//! Get Current Value of Counter 0
//!
//! \param base is the DCC module base address
//!
//! This function gets current value of counter 0.
//!
//! \note Reads of the counter value may not be exact since the read operation
//! is synchronized to the vbus clock.
//!
//! \return Returns the current value of counter 0.
//
//*****************************************************************************
static inline uint32_t
DCC_getCounter0Value(uint32_t base)
{
    uint32_t value;

    //
    // Check the arguments.
    //
    ASSERT(DCC_isBaseValid(base));

    //
    // Get the current counter 0 value
    //
    value = HWREGH(base + DCC_O_CNT0) & DCC_REG_WORD_MASK;
    value |= ((uint32_t)(HWREGH(base + DCC_O_CNT0 + 2U) &
              (DCC_CNT0_COUNT0_M >> 16U)) << 16U);

    return(value);
}

//*****************************************************************************
//
//! Get Current Value of the Valid Duration Counter for Counter 0
//!
//! \param base is the DCC module base address
//!
//! This function gets current value of the valid duration counter for
//! counter 0.
//!
//! \note Reads of the counter value may not be exact since the read operation
//! is synchronized to the vbus clock.
//!
//! \return Returns the current value of the valid duration counter.
//
//*****************************************************************************
static inline uint16_t
DCC_getValidCounter0Value(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DCC_isBaseValid(base));

    //
    // Get the current valid duration counter value
    //
    return(HWREGH(base + DCC_O_VALID0));
}

//*****************************************************************************
//
//! Get Current Value of Counter 1
//!
//! \param base is the DCC module base address
//!
//! This function gets current value of counter 1.
//!
//! \note Reads of the counter value may not be exact since the read operation
//! is synchronized to the vbus clock.
//!
//! \return Returns the current value of counter 1.
//
//*****************************************************************************
static inline uint32_t
DCC_getCounter1Value(uint32_t base)
{
    uint32_t value;

    //
    // Check the arguments.
    //
    ASSERT(DCC_isBaseValid(base));

    //
    // Get the current counter 1 value
    //
    value = HWREGH(base + DCC_O_CNT1) & DCC_REG_WORD_MASK;
    value |= ((uint32_t)(HWREGH(base + DCC_O_CNT1 + 2U) &
              (DCC_CNT1_COUNT1_M >> 16U)) << 16U);

    return(value);
}

//*****************************************************************************
//
//! Set Counter 1 Clock Source
//!
//! \param base is the DCC module base address
//! \param source is the selected clock source for counter 1
//!
//! This function sets the counter 1 clock source.
//!
//! The \e source parameter can have one of thirty-one values:
//! - \b DCC_COUNT1SRC_PLL        - PLL021SSP Clock Out Source
//! - \b DCC_COUNT1SRC_AUXPLL     - AUXPLL Clock Out Source
//! - \b DCC_COUNT1SRC_INTOSC1    - Internal Oscillator1 Clock Source
//! - \b DCC_COUNT1SRC_INTOSC2    - Internal Oscillator2 Clock Source
//! - \b DCC_COUNT1SRC_PUMOSC     - PUMOSC Clock Source
//! - \b DCC_COUNT1SRC_CMCLK      - CM Clock Source
//! - \b DCC_COUNT1SRC_CPU1SYSCLK - CPU1 System Clock Source
//! - \b DCC_COUNT1SRC_ENET_RXCLK - etherNET RXCLK Clock Source
//! - \b DCC_COUNT1SRC_CPU2SYSCLK - CPU2 System Clock Source
//! - \b DCC_COUNT1SRC_CROSSBAR   - Input Crossbar Clock Source
//! - \b DCC_COUNT1SRC_AUXCLK     - AUX Clock Source
//! - \b DCC_COUNT1SRC_ETPWM      - ETPWM Clock Source
//! - \b DCC_COUNT1SRC_LSPCLK     - LSP Clock Source
//! - \b DCC_COUNT1SRC_ECAT0_RXCL - MII0 RXCLK(etherCAT) Clock Source
//! - \b DCC_COUNT1SRC_WDCLK      - Watch Dog Clock Source
//! - \b DCC_COUNT1SRC_CANX       - CANxBIT Clock Source
//! - \b DCC_COUNT1SRC_SYSAPLLCLK     - System APLL Clock Source
//! - \b DCC_COUNT1SRC_SYSAPLLVCO     - System APLL Voltage control
//! - \b DCC_COUNT1SRC_SYSAPLLVCO_BY2 - System APLL Voltage control
//! - \b DCC_COUNT1SRC_SYSAPLLFMDIV   - System APLL FM DIV
//! - \b DCC_COUNT1SRC_SYSAPLLFNDIV   - System APLL FN DIV
//! - \b DCC_COUNT1SRC_SYSAPLLINTOSC  - System APLL Internal Osc Clk
//! - \b DCC_COUNT1SRC_SYSAPLLCLK_AUX - System APLL Aux Clk
//! - \b DCC_COUNT1SRC_ECAT1_RXCLK    - MII1 RXCLK(etherCAT) Clk Src
//! - \b DCC_COUNT1SRC_AUXAPLLCLK     - Aux APLL Clock Source
//! - \b DCC_COUNT1SRC_AUXAPLLVCO     - Aux APLL Voltage control Src
//! - \b DCC_COUNT1SRC_AUXAPLLVCO_BY2 - Aux APLL Voltage control Src
//! - \b DCC_COUNT1SRC_AUXAPLLFMDIV   - Aux APLL FM DIV Source
//! - \b DCC_COUNT1SRC_AUXAPLLFNDIV   - Aux APLL FN DIV Source
//! - \b DCC_COUNT1SRC_AUXAPLLINTOSC  - Aux APLL Internal Osc Clk
//! - \b DCC_COUNT1SRC_AUXAPLLCLK_AUX - Aux APLL Aux Clk Source
//!
//! \return None.
//
//*****************************************************************************
static inline void
DCC_setCounter1ClkSource(uint32_t base, DCC_Count1ClockSource source)
{
    //
    // Check the arguments.
    //
    ASSERT(DCC_isBaseValid(base));

    //
    //  Set the specified clock source
    //
    EALLOW;

    //
    //  DCC Clk source is of 5bits DCCCLKSRC1[4:0]
    //
    HWREGH(base + DCC_O_CLKSRC1) = (HWREGH(base + DCC_O_CLKSRC1) &
                                   (DCC_REG_BYTE_MASK << 5U)) |
                                   ((DCC_ENABLE_VALUE << 12U) |
                                   (uint16_t)source);

    EDIS;
}

//*****************************************************************************
//
//! Set Counter 0 Clock Source
//!
//! \param base is the DCC module base address
//! \param source is the selected clock source for counter 0
//!
//! This function sets the counter 0 clock source.
//!
//! The \e source parameter can have one of six values:
//! - \b DCC_COUNT0SRC_XTAL       - Accurate Clock Source
//! - \b DCC_COUNT0SRC_INTOSC1    - Internal Oscillator1 Clock Source
//! - \b DCC_COUNT0SRC_INTOSC2    - Internal Oscillator2 Clock Source
//! - \b DCC_COUNT0SRC_CPU1SYSCLK - CPU1 System Clock Source
//! - \b DCC_COUNT0SRC_CPU2SYSCLK - CPU2 System Clock Source
//! - \b DCC_COUNT0SRC_XBAR       - Input XBAR Clock Source
//!
//! \return None.
//
//*****************************************************************************
static inline void
DCC_setCounter0ClkSource(uint32_t base, DCC_Count0ClockSource source)
{
    //
    // Check the arguments.
    //
    ASSERT(DCC_isBaseValid(base));

    //
    //  Set the specified clock source
    //
    EALLOW;

    //
    //  DCC Clk source is of 5bits DCCCLKSRC0[4:0]
    //
    HWREGH(base + DCC_O_CLKSRC0) = (HWREGH(base + DCC_O_CLKSRC0) &
                                   (DCC_REG_BYTE_MASK << 5U)) |
                                   ((DCC_ENABLE_VALUE << 12U) |
                                   (uint16_t)source);

    EDIS;
}

//*****************************************************************************
//
//! Get Counter 1 Clock Source
//!
//! \param base is the DCC module base address
//!
//! This function gets the counter 1 clock source.
//!
//! \return Returns one of the following enumerated source values:
//! - \b DCC_COUNT1SRC_PLL        - PLL021SSP Clock Out Source
//! - \b DCC_COUNT1SRC_AUXPLL     - AUXPLL Clock Out Source
//! - \b DCC_COUNT1SRC_INTOSC1    - Internal Oscillator1 Clock Source
//! - \b DCC_COUNT1SRC_INTOSC2    - Internal Oscillator2 Clock Source
//! - \b DCC_COUNT1SRC_PUMOSC     - PUMOSC Clock Source
//! - \b DCC_COUNT1SRC_CMCLK      - CM Clock Source
//! - \b DCC_COUNT1SRC_CPU1SYSCLK - CPU1 System Clock Source
//! - \b DCC_COUNT1SRC_ENET_RXCLK - etherNET RXCLK Clock Source
//! - \b DCC_COUNT1SRC_CPU2SYSCLK - CPU2 System Clock Source
//! - \b DCC_COUNT1SRC_CROSSBAR   - Input Crossbar Clock Source
//! - \b DCC_COUNT1SRC_AUXCLK     - AUX Clock Source
//! - \b DCC_COUNT1SRC_ETPWM      - ETPWM Clock Source
//! - \b DCC_COUNT1SRC_LSPCLK     - LSP Clock Source
//! - \b DCC_COUNT1SRC_ECAT0_RXCL - MII0 RXCLK(etherCAT) Clock Source
//! - \b DCC_COUNT1SRC_WDCLK      - Watch Dog Clock Source
//! - \b DCC_COUNT1SRC_CANX       - CANxBIT Clock Source
//! - \b DCC_COUNT1SRC_SYSAPLLCLK     - System APLL Clock Source
//! - \b DCC_COUNT1SRC_SYSAPLLVCO     - System APLL Voltage control
//! - \b DCC_COUNT1SRC_SYSAPLLVCO_BY2 - System APLL Voltage control
//! - \b DCC_COUNT1SRC_SYSAPLLFMDIV   - System APLL FM DIV
//! - \b DCC_COUNT1SRC_SYSAPLLFNDIV   - System APLL FN DIV
//! - \b DCC_COUNT1SRC_SYSAPLLINTOSC  - System APLL Internal Osc Clk
//! - \b DCC_COUNT1SRC_SYSAPLLCLK_AUX - System APLL Aux Clk
//! - \b DCC_COUNT1SRC_ECAT1_RXCLK    - MII1 RXCLK(etherCAT) Clk Src
//! - \b DCC_COUNT1SRC_AUXAPLLCLK     - Aux APLL Clock Source
//! - \b DCC_COUNT1SRC_AUXAPLLVCO     - Aux APLL Voltage control Src
//! - \b DCC_COUNT1SRC_AUXAPLLVCO_BY2 - Aux APLL Voltage control Src
//! - \b DCC_COUNT1SRC_AUXAPLLFMDIV   - Aux APLL FM DIV Source
//! - \b DCC_COUNT1SRC_AUXAPLLFNDIV   - Aux APLL FN DIV Source
//! - \b DCC_COUNT1SRC_AUXAPLLINTOSC  - Aux APLL Internal Osc Clk
//! - \b DCC_COUNT1SRC_AUXAPLLCLK_AUX - Aux APLL Aux Clk Source

//
//*****************************************************************************
static inline uint16_t
DCC_getCounter1ClkSource(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DCC_isBaseValid(base));

    //
    //  Get the specified clock source
    //
    return(HWREGH(base + DCC_O_CLKSRC1) & DCC_CLKSRC1_CLKSRC1_M);
}

//*****************************************************************************
//
//! Get Counter 0 Clock Source
//!
//! \param base is the DCC module base address
//!
//! This function gets the counter 0 clock source.
//!
//! \return Returns one of the following enumerated source values:
//! - \b DCC_COUNT0SRC_XTAL       - Accurate Clock Source
//! - \b DCC_COUNT0SRC_INTOSC1    - Internal Oscillator1 Clock Source
//! - \b DCC_COUNT0SRC_INTOSC2    - Internal Oscillator2 Clock Source
//! - \b DCC_COUNT0SRC_CPU1SYSCLK - CPU1 System Clock Source
//! - \b DCC_COUNT0SRC_CPU2SYSCLK - CPU2 System Clock Source
//! - \b DCC_COUNT0SRC_XBAR       - Input XBAR Clock Source
//
//*****************************************************************************
static inline uint16_t
DCC_getCounter0ClkSource(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(DCC_isBaseValid(base));

    //
    //  Get the specified clock source
    //
    return(HWREGH(base + DCC_O_CLKSRC0) & DCC_CLKSRC0_CLKSRC0_M);
}

//*****************************************************************************
//
//! Set the seed values
//!
//! \param base is the DCC module base address
//! \param counter0 sets the seed value that gets loaded into Counter 0
//! \param validCounter0 sets the seed value that gets loaded into the valid
//!  duration counter for Counter 0
//! \param counter1 sets the seed value that gets loaded into Counter 1
//!
//! This function sets the seed values for Counter 0, Valid Duration Counter 0,
//! and Counter 1.
//!
//! \note
//! -# Operating DCC with '0' set as the seed value for Counter 0, Valid
//! Duration Counter 0, and/or Counter 1 will result in undefined operation.
//! -# The Valid Duration Counter 0 is designed to be at least four cycles
//! wide and shouldn't be programmed with a value less than '4'.
//!
//! \return None.
//
//*****************************************************************************
static inline void
DCC_setCounterSeeds(uint32_t base, uint32_t counter0, uint32_t validCounter0,
                    uint32_t counter1)
{
    //
    // Check the arguments.
    //
    ASSERT(DCC_isBaseValid(base));
    ASSERT(validCounter0 >= 4U);
    ASSERT(counter0 > 0U);
    ASSERT(counter1 > 0U);

    EALLOW;

    //
    // Set Counter 0 Seed
    //
    HWREGH(base + DCC_O_CNTSEED0) = counter0 & DCC_REG_WORD_MASK;
    HWREGH(base + DCC_O_CNTSEED0 + 2U) = (HWREGH(base + DCC_O_CNTSEED0 + 2U) &
                                          DCC_SEED_REG_MASK) |
                                         ((uint32_t)(counter0 &
                                          DCC_SEED_CNT_MASK) >> 16U);

    //
    // Set Valid Duration Counter 0 Seed
    //
    HWREGH(base + DCC_O_VALIDSEED0) = validCounter0;

    //
    // Set Counter 1 Seed
    //
    HWREGH(base + DCC_O_CNTSEED1) = counter1 & DCC_REG_WORD_MASK;
    HWREGH(base + DCC_O_CNTSEED1 + 2U) = (HWREGH(base + DCC_O_CNTSEED1 + 2U) &
                                          DCC_SEED_REG_MASK) |
                                         ((uint32_t)(counter1 &
                                          DCC_SEED_CNT_MASK) >> 16U);

    EDIS;
}

//*****************************************************************************
//
//! Get DCC Version Number
//!
//! \param base is the DCC module base address
//! \param identifier is the selected revision number identifier
//!
//! This function gets the specific version number.
//!
//! The \e identifier parameter can have one of six values:
//! - \b DCC_REVISION_MINOR      - The minor revision number
//! - \b DCC_REVISION_CUSTOM     - The custom module number
//! - \b DCC_REVISION_MAJOR      - The major revision number
//! - \b DCC_REVISION_DESIGN     - The design release number
//! - \b DCC_REVISION_FUNCTIONAL - The functional release number
//! - \b DCC_REVISION_SCHEME     - The scheme of the module
//!
//! \return Specified revision number
//
//*****************************************************************************
extern uint16_t
DCC_getRevisionNumber(uint32_t base, DCC_RevisionNumber identifier);

//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif // DCC_H
